problema2/README.org
#+TITLE: Problema 2
#+AUTHOR: quimpm, sergisi

* Input format

\begin{verbatim}
% separados por un espacio %
tiempoSemanas = "T", % numero %
biblioteca = "L", id, { % { tiempo id j | j <- [ 0 .. id_max] }  % }
id = % numero unico por tipo %
tiempo id j = % tiempo de tranporte de un libro desde la
              - libreria id hasta j
              %
libro = "B", id, id biblioteca, valor
valor = % numero %
lector = "R", id, id biblioteca, { id libro, tiempo lectura }
tiempo lectura = % numero de tiempo que se
                 - tarda en leer el libro id libro
                 %
\end{verbatim}

| 0 | 2 | 3 |
| 3 | 0 | 4 |
| 3 | 4 | 0 |

Por ejemplo:
\begin{verbatim}
L 0 0 2 3
L 1 3 0 4
L 2 3 4 0
B 0 0 5
B 1 0 3
B 2 1 10
B 3 2 2
B 4 2 8
R 0 0 0 10 1 2
R 1 0 1 1 2 10 3 3
R 2 1 0 1 1 1 2 1 3 1 4 1
R 3 2 2 5 4 5
\end{verbatim}

En este ejemplo, hay tres librerias, donde el coste de llevar un libro
de la biblioteca "0" hasta la "1" es de 2. Véase que el coste de llevar
el libro de la biblioteca "1" hasta la "0" es de 3. Además, el coste de
llevar un libro de una biblioteca a si misma siempre es de 0.

Tambien se puede apreciar el formato de los libros, donde el primer es
el id del libro, el segundo es el id de la biblioteca donde se encuentra
en el estado inicial, y el tercero es el valor que produce el libro en
ser leido por el lector.

Finalmente, se puede apreciar que el lector con id "0", que esta afiliado
a la biblioteca "0", quiere leer los libros "0" y "1", que tardará en
hacerlo "10" y "2" respectivamente.
