problema2/README.tex
% Created 2020-10-18 Sun 17:17
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{quimpm, sergisi}
\date{\today}
\title{Problema 2}
\hypersetup{
 pdfauthor={quimpm, sergisi},
 pdftitle={Problema 2},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Input format}
\label{sec:org5a60226}

\begin{verbatim}
% separados por un espacio %
biblioteca = "L", id, { % { tiempo id j | j <- [ 0 .. id_max] }  % }
id = % numero unico por tipo %
tiempo id j = % tiempo de tranporte de un libro desde la
              - libreria id hasta j
              %
libro = "B", id, id biblioteca, valor
valor = % numero %
lector = "R", id, id biblioteca, { id libro, tiempo lectura }
tiempo lectura = % numero de tiempo que se
                 - tarda en leer el libro id libro
                 %
\end{verbatim}

Por ejemplo:
\begin{verbatim}
L 0 0 2 3
L 1 3 0 4
L 2 3 4 0
B 0 0 5
B 1 0 3
B 2 1 10
B 3 2 2
B 4 2 8
R 0 0 0 10 1 2
R 1 0 1 1 2 10 3 3
R 2 1 0 1 1 1 2 1 3 1 4 1
R 3 2 2 5 4 5
\end{verbatim}

En este ejemplo, hay tres librerias, donde el coste de llevar un libro
de la biblioteca ``0'' hasta la ``1'' es de 2. Véase que el coste de llevar
el libro de la biblioteca ``1'' hasta la ``0'' es de 3. Además, el coste de
llevar un libro de una biblioteca a si misma siempre es de 0.

Tambien se puede apreciar el formato de los libros, donde el primer es
el id del libro, el segundo es el id de la biblioteca donde se encuentra
en el estado inicial, y el tercero es el valor que produce el libro en
ser leido por el lector.

Finalmente, se puede apreciar que el lector con id ``0'', que esta afiliado
a la biblioteca ``0'', quiere leer los libros ``0'' y ``1'', que tardará en
hacerlo ``10'' y ``2'' respectivamente.
\end{document}
